# Избыточность локальных сетей. STP
# Лабораторная работа №3. Развертывание коммутируемой сети с резервными каналами.

### Схема сети

![](network.jpg)

### Таблица адресации
Устройство | Интерфейс | IP-адрес | Маска подсети
----- | ----- | ----- | -----
S1 | VLAN 1 | 192.168.1.1 | 255.255.255.0
S2 | VLAN 1 | 192.168.1.2 | 255.255.255.0
S3 | VLAN 1 | 192.168.1.3 | 255.255.255.0

### Задание:
#### Часть 1. Создание сети и настройка основных параметров устройства
#### Часть 2. Выбор корневого моста
#### Часть 3. Наблюдение за процессом выбора протоколом STP порта, исходя из стоимости портов
#### Часть 4. Наблюдение за процессом выбора протоколом STP порта, исходя из приоритета портов



### Часть 1. Создание сети и настройка основных параметров устройства

*Шаг 1: Создать сеть согласно топологии.*
Подключили устройства, как показано в топологии, и подсоединили необходимые кабели.

*Шаг 2. Выполнить инициализацию и перезагрузку коммутаторов.*

*Шаг 3. Настроить базовые параметры каждого коммутатора.*
  
Пример для S1
 - Отключить поиск DNS и присвоить имена устройствам в соответствии с топологией.
``` bash
Switch(config)#hostname S3
S3(config)#no ip domain-lookup
S3(config)#exit
S3#wr
```


- Настройте баннерное сообщение дня (MOTD) для предупреждения пользователей о запрете несанкционированного доступа.
- Задайте IP-адрес, указанный в таблице адресации для VLAN 1 на обоих коммутаторах.
- Скопируйте текущую конфигурацию в файл загрузочной конфигурации.

- Назначьте class в качестве зашифрованного пароля доступа к привилегированному режиму.
``` bash
S1(config)#service password-encryption 
S1(config)#enable secret class
```
- Назначьте cisco в качестве паролей консоли и VTY и активируйте вход для консоли и VTY каналов. Настройте logging synchronous для консольного канала.

назначение пароля для консоли
``` bash
S1(config)#line console 0
S1(config-line)#password cisco
S1(config-line)#exec-timeout 5 0 
S1(config-line)#logging synchronous
S1(config-line)#login
S1(config-line)#exit
```
назначение пароля для telnet
``` bash
S1(config)#line vty 0 4
S1(config-line)#password cisco
S1(config-line)#exec-timeout 5 0 
S1(config-line)#logging synchronous
S1(config-line)#login
S1(config-line)#exit
```

- Настроить баннерное сообщение дня (MOTD) для предупреждения пользователей о запрете несанкционированного доступа.
``` bash
S1(config)#banner motd #Enter password for access#
```
- Задали IP-адрес, указанный в таблице адресации для VLAN 1 на всех коммутаторах.

Пример для S1
